# GetNumberOfShapeHandlePoints Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdaptiveComponentFamilyUtils..::..GetNumberOfShapeHandlePoints Method
AdaptiveComponentFamilyUtils Class See Also
---
Gets number of Shape Handle Point Elements in Adaptive Component Family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static int GetNumberOfShapeHandlePoints(
	Family family
)
```

Visual Basic
---
```text
Public Shared Function GetNumberOfShapeHandlePoints ( _
	family As Family _
) As Integer
```

Visual C++
---
```text
public:
static int GetNumberOfShapeHandlePoints(
	Family^ family
)
```

# ### Parameters
family
    Type: Autodesk.Revit.DB..::..Family The Family
# ### Return Value
Number of Adaptive Shape Handle Point Element References in the Adaptive Component Family.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The Family family is not an Adaptive Component Family. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation failed. |

# See Also
AdaptiveComponentFamilyUtils Class
Autodesk.Revit.DB Namespace